sistema-greenhouse/app/Models/CabañaModel.php

SELECT `cabaña`.*, `capacidad`.`descripcion` AS `capacidad`, `estado`.`descripcion` AS `estado`
FROM `cabaña`
LEFT JOIN `reserva` ON reserva.`cabaña-id` = cabaña.`cabaña-id`
JOIN `capacidad` ON capacidad.`capacidad-id` = cabaña.`capacidad-id`
JOIN `estado` ON estado.`estado-id` = cabaña.`estado-id`
WHERE `reserva`.`reserva-id` IS NULL
OR `reserva`.`fecha-llegada` > '2024-05-02'
OR `reserva`.`fecha-salida` < '2024-04-02'
---
    public function consultarCabañas($fechaEntrada, $fechaSalida)
    {
        return $this->select('cabaña.*, capacidad.capacidad-nombre AS capacidad, estado.estado-nombre AS estado')
                    ->join('reserva', 'reserva.`cabaña-id` = cabaña.`cabaña-id`', 'left')
                    ->join('capacidad', 'capacidad.`capacidad-id` = cabaña.`capacidad-id`')
                    ->join('estado', 'estado.`estado-id` = cabaña.`estado-id`')
                    ->where('reserva.`reserva-id` IS NULL')
                    ->orWhere('reserva.`fecha-entrada` >', $fechaSalida)
                    ->orWhere('reserva.`fecha-salida` <', $fechaEntrada)
                    ->findAll();

SELECT `cabaña`.*, `capacidad`.`descripcion` AS `capacidad`, `estado`.`descripcion` AS `estado`
FROM `cabaña`
JOIN `capacidad` ON `capacidad`.`capacidad-id` = `cabaña`.`capacidad-id`
JOIN `estado` ON `estado`.`estado-id` = `cabaña`.`estado-id`
WHERE `cabaña`.`cabaña-id` = '2'
 LIMIT 1
---
    public function buscarCabañaId($id)
    {
        return $this->select('cabaña.*, capacidad.capacidad-nombre AS capacidad, estado.estado-nombre AS estado')
                    ->join('capacidad', 'capacidad.capacidad-id = cabaña.capacidad-id')
                    ->join('estado', 'estado.estado-id = cabaña.estado-id')
                    ->where('cabaña.cabaña-id', $id)
                    ->first();