sistema-greenhouse/app/Controllers/Cabaña.php

    public function detalles($id)
    {
        $cabañaModel = new CabañaModel();
        $cabaña = $cabañaModel->find($id);
---
SELECT *
FROM `cabaña`
WHERE `cabaña`.`cabaña-id` = '1'