sistema-greenhouse/app/Controllers/Usuario.php

    public function login()
    {
        $session = session();
        $model   = new UsuarioModel();
        $usuario = $this->request->getVar('usuario');
        $pass    = $this->request->getVar('contraseña');
        $data    = $model->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'juanperez'
 LIMIT 1